# NumberOfSections Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableData..::..NumberOfSections Property
TableData Class See Also
---
Gets the number of items in section data array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumberOfSections { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfSections As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfSections {
	int get ();
}
```

# See Also
TableData Class
Autodesk.Revit.DB Namespace